{
  "issues": [
    {
      "category": "Security",
      "description": "CORS Configuration Too Permissive",
      "expected_behavior": "Restrict CORS origins to specific frontend domain in production configuration instead of allowing all origins",
      "passes": false
    },
    {
      "category": "Production Bug",
      "description": "Hardcoded Localhost URLs",
      "expected_behavior": "Replace hardcoded localhost URLs with configurable API base URL that works in production environments",
      "passes": false
    },
    {
      "category": "Backend Bug",
      "description": "TTS Error Audio File Missing",
      "expected_behavior": "Create or ensure error.wav file exists at /static/error.wav path, or implement proper error handling for missing error audio",
      "passes": false
    },
    {
      "category": "Backend Bug",
      "description": "Settings File Path Construction",
      "expected_behavior": "Fix complex relative path construction in settings_service.py to use absolute paths consistently and prevent path resolution issues",
      "passes": false
    },
    {
      "category": "Backend Bug",
      "description": "Synchronous File Operations in Async Context",
      "expected_behavior": "Replace synchronous file operations with async alternatives (aiofiles) to prevent blocking the event loop",
      "passes": false
    },
    {
      "category": "UX",
      "description": "Add a delete all history button",
      "expected_behavior": "Add a button to clear all chat history at once",
      "passes": false
    },
    {
      "category": "Backend Bug",
      "description": "Session manager is injecting prompts directly during wrap up",
      "expected_behavior": "Wrap up prompt should be handled by llm service, not session manager",
      "passes": false
    },
    {
      "category": "Feature",
      "description": "Add TTS speed setting for user preferences",
      "expected_behavior": "Add a new user setting to control TTS speech speed (0.5-2.0 range, default 1.0). This is especially useful for beginners who may need slower speech. The Kokoro library already supports speed parameter - need to expose it in settings UI and pass it through to the TTS service.",
      "passes": false
    },
    {
      "category": "Backend Bug",
      "description": "analyze_grammar function language confusion",
      "expected_behavior": "The analyze_grammar function in llm_service.py should ensure original and corrected sentences are in the target language the user is learning, while summary and explanations should be in the user's primary language. Current implementation may mix languages or provide explanations in the wrong language.",
      "passes": false
    }
  ]
}